package JavaCourse.Seminar6;

// 1. Продумайте структуру класса Кот. Какие поля и методы будут актуальны для приложения, которое является
// а) информационной системой ветеринарной клиники
// б) архивом выставки котов
// в) информационной системой Театра кошек Ю. Д. Куклачёва
// Можно записать в текстовом виде, не обязательно реализовывать в java.

public class task2 {
    // а) ветклиника
    //     id, birthdate, breed, name, owner, diagnosis, injections, пол
    // б) архив выставки котов
    //     id, birthdate, breed, name, owner, класс, клуб, окрас, пол, вес
    // в) информационная система Театра кошек Ю. Д. Куклачёва
    //     Имя, ID, порода, год рождения, навыки
    

    
}